import 'package:dananer/view/auth/login.dart';

import '../ navigation/navigation.dart';
import '../network/local/cache_helper.dart';

String token='';
String id='';
String adminOrUser='' ;
String phone='7826084404' ;
String telegram='Coinc3' ;
String googlePlay='' ;
String appStore='' ;
String nameApp='كوينز كاش' ;
String howWeAre='لا يُسمح لك باستخدام أو إعادة إنتاج أو توزيع هذه العناصر دون موافقتنا الخطية المسبقة \n  منع سوء الاستخدام \n من غير القانوني استخدام كوينز كاش للترويج لمحتوى غير لائق أو توزيعه. قد يؤدي أي سوء استخدام للتطبيق إلى اتخاذ إجراء فوري، بما في ذلك إنهاء الحساب.  يتم تقديم كوينز كاش"كما هو" ولا نضمن أن يكون التطبيق غير متقطع أو خالي من الأخطاء أو آمنًا. لن نكون مسؤولين عن أي أضرار غير مباشرة أو خاصة أو عرضية أو تبعية ناتجة عن استخدام التطبيق أو عدم القدرة على استخدامه، حتى لو تم إخطارنا بإمكانية حدوث مثل هذه الأضرار. \n  نحتفظ بالحق في تعديل شروط الاستخدام هذه في أي وقت. سيتم نشر أي تغييرات على هذه الصفحة وستكون سارية المفعول فور نشرها. أنت مسؤول عن مراجعة هذه الشروط بانتظام للبقاء على اطلاع على أي تغييرات  \n  لنا الحق في التغيير و إضافة و التعديل في سياسة التطبيق في اي وقت وكما نراه مناسب وبدون اعلان مسبق \n يحتفظ كوينز كاشبالحق في حذف الحسابات تلقائيًا التي كانت غير نشطة لمدة 90 يومًا. \n أي شخص لا يقبل شروط الاستخدام لتطبيق كوينز كاشيجب عليه الاتصال بالدعم لحذف حسابه أو ببساطة عدم استخدام التطبيق لمدة 90 يومًا، وبعدها سيتم حذف الحساب تلقائيًا. \n  إذا كانت دولتك لا تسمح باستخدام تطبيق كوينز كاشبشكل عام أو جزئي وقررت استخدام كوينز كاشعلى الرغم من ذلك، فإنك تتحمل المسؤولية القانونية الكاملة وفقًا لقوانين دولتك. \n  تحكم شروط الاستخدام هذه بقوانين الإمارات العربية المتحدة. ستخضع أي نزاعات تتعلق بهذه الشروط للاختصاص القضائي الحصري لمحاكم الإمارات العربية المتحدة. \n  الاستثمار هو ربح وخسارة انت معنى في الربح ومعنا في الخساره اي معنى في السراء والضراء ولكن قدر الإمكان سنجعلك دائما تربح \n لو خسر المشروع في سنه من السنين فأنت معنا حالك من حالنا ولا يحق لك الشكوه علينا أو المطالبه لأن الاستثمار معروف عالميا هو انت معهم بالربح والخسارة \n صاحب التطبيق رجل يخاف الله ويحافظ على سمعته وسمعت عائلته لذا وانت معه كن مطمئنا انت ومالك بأيدي امينه  ' ;

void signOut(context)
{
  CacheHelper.removeData(
    key: 'token',
  ).then((value)
  {
    token='';
    adminOrUser='' ;
    id='' ;
    if (value)
    {
      CacheHelper.removeData(key: 'role',);
      CacheHelper.removeData(key: 'id',);
      navigateTo(context, const Login(),);
    }
  });
}
